{
    "What is a trademark?": {
        "definition": "A trademark is a any word, slogan, symbol, design, or combination of these that identifies the source of your goods and services and distinguishes them from the goods and services of another party",
        "summed up": "The only purpose of a trademark is to identify and distinguish",
        "ps": "A trademark can be a sound, a color, a smell, or anything that identifies and distinguishes your brand.",
        "difference between trademark and a patent?": "Patents protect inventions, copyrights protect artistic and literary works. All three protect intellectual property",
        "what's an example?": "Samsung might use a patent to protect their phone technology, a trademark to protect their logo, and a copyright to protect their commercial for that phone.",
        "domain names and business names": "A domain name can function as a trademark, but domain registration is not federal trademark registration.  Likewise, a business name can function as a trademark, but registration of the business name does not automatically count as a trademark registration."
    },
    "Why does federal registration matter?": {
        "common law trademark": "rights are limited to a geographical area in which the business is",
        "federal registration provides...": [
            "legal presumption that you're the owner of the mark",
            "legal presumption of exclusive right to use the mark",
            "puts the public on notice of ownership of the mark",
            "mark listed in the USTPO database",
            "registration with U.S. Customs and border protection",
            "right to bring legal action against a confusingly similar mark in federal court",
            "an opportunity to apply for trademark registration in foreign countries",
            "right to use the registered trademark symbol"
        ],
        "summed up": "registering a trademark means you're calling dibs on the way people know and recognize your business. You're putting your stake in the ground for that logo."
    },
    "How to do it": {
        "prerequisites": [
            "not every mark will register and the mark can still be challenged",
            "avoid likelihood of confusion - if your mark looks, sounds, or smells too much like another mark, the USPTO might interpret them as having similar meanings and creating similar commercial impressions. If consumers might believe the goods and services are coming from the same source, the trademark would not do its job of uniquely distinguishing and identifying your business"
        ],
        "trademark clearance search": "trademark electronic search system, state trademark databases, business name databases, google",
        "strength of the mark": [
            "how legally defensible is the mark?",
            "generic marks are common, everyday names for goods and services, e.g. bike for a bicycle shop",
            "descriptive marks are still very common, but are more like using creamy for a yogurt stand",
            "fanciful marks are invented words without a dictionary definition, e.g. microsoft, cusinart",
            "arbitrary marks are also strong, even though they have a dictionary definition, it's not associated with the goods or services, e.g. apple, blackberry, tesla, gap",
            "PS - it's especially dangerous to use a generic or descriptive mark, because you cannot defend that consumers have come to understand that your mark means ONLY your particular goods and services - not just the goods and services from anyone e.g. Zipper, Escalator, YoYo. Fanciful marks are much easier to protect."
        ],
        "Make sure your mark is...": [
            "not likely to be confused with another",
            "not a surname",
            "not geographically descriptive",
            "not deceptive, disparaging, or offensive (obviously there's some wiggle room here)",
            "not a misspelling of descriptive or generic words",
            "not a name or likeness of a person (who hasn't given consent)",
            "not the title of a single book or movie",
            "not an ornamental or decorative matter",
            "In the end, it's your legal responsibility to police your mark - The USPTO won't enforce your rights to the trademark for you"
        ],
        "Applying": {
            "important note": "applying for registration correctly will save you thousands of dollars in fees. While I can share information with you here, I can't give legal advice or recommend an exact course of action - that's an attorney's job.  The big takeaway is that trademark applications are best filed in a way that will give you the most flexibility in the future as your brand evolves.",
            "Factors affecting fees": [
                "number of trademarks - separate applications",
                "number of goods and services classes - separate fees",
                "which form you use - TEAS Regular ($400), TEAS Plus ($200 + specific requirements), TEAS RF ($275 + specific requirements)",
                "basis for filing - statement of use ($100 per class)",
                "$125 registration maintenance fee after 5 years of use",
                "$425 registration renewal fee after 9 years of use"
            ],
            "Types of mark 'drawings'": [
                "Standard character mark is just the plain text name of your brand. I grants protection to the wording itself, meaning you can change how you display the wording later, without having to re-file.",
                "Special form marks include stylized wordmarks and logo designs"
            ],
            "Being specific with the mark": [
                "The submitted image must contain the whole mark, with nothing cut off",
                "The description must be clear and precise (e.g. 'the mark consists of the wording 'Braden East Studio' in a stylized manner')",
                "To claim your colors, say something like 'The colors Blue and Black are claimed as a feature of the mark'",
                "The most flexible way would be to submit the mark in black and white - indicating that no colors are claimed. This way, if you do decide to change colors later, your trademark is still legally protectable and doesn't need a new registration filed."
            ],
            "Goods vs Services": ""
        }
    },
    "Resources": {
        "USPTO.GOV": "obviously",
        "email": "TrademarkAssistanceCenter@uspto.gov",
        "hire an attorney": "They'll help you police your rights and navigate the application process",
        "USPTO Law School Clinic": "Law students who can help you with your trademark for free",
        "SCORE Program": "score.org",
        "Patent & Trademark Resource Center": "PTRC page on USPTO.GOV",
        "USPTO ID Manual": "helps you discover if your business falls under Goods or Services"
    }
}