{
    "title": "Asking good questions to understand the problem (Church Branding #1)",
    "date": "2019-06-23",
    "tags": [
        "brand strategy",
        "identity design"
    ],
    "body": "Let's get to the heart of the challenges facing our branding & design clients. The church we're rebranding in this series is called 'Witness Church.' Witness Church is a multi-site, nondenominational church with locations in major Italian cities. Right now, they're struggling to distinguish themselves from the many other well-known churches and cathedrals in Italy.<br />Let’s try to help them develop a brand identity that will set them apart and help them acheive their goals for the next several decades.<br />I see businesses everywhere using buzzwords like 'integrative,' 'agile,' and 'disruptive.' While these words might technically be accurate, they translate as jargon.<br />Churches often do the same thing. Ever heard 'gospel-centered,' or 'dynamic discipleship'? There's nothing inherently wrong with these ideas, but they also don't do anything to help a church stand out from the noise.<br />Let’s try to help them develop a brand identity that will set them apart and help them acheive their goals for the next several decades.<h2>First, we'll ask questions and listen.</h2>Many churches will start the rebrand process without a clear direction or defining the problem they're trying to solve.<br />To help Witness Church start off right, we’ll sit down for a “get to know you” session. Once the ice is broken I usually say something like, “Okay let’s get into it... Why are we here?”  Most of the time this is a good, open-ended starting point.<br />The key here is to ask good questions. Here are some examples:<ul><li>”What kind of audience are you reaching now?”</li><li>”How do most people discover you?”</li><li>”Why do they stay once they’re here?”</li></ul>Let’s imagine that we asked Witness Church these questions.  They might say that most of their core members are younger locals, while older people who live farther away rarely seek membership or get involved.<br />We might also discover that they have huge fluctuations in attendance, especially during tourist seasons.<br />That clues us in to the fact that people might not be finding what they’re looking for at the church. As it turns out, Catholic Churches and cathedrals are extremely popular tourist attractions in major Italian cities, which means many people might be coming to Witness Church looking for a traditional flavor more akin to mass than contemporary worship.  Those people don’t seem to be our target market of the church, and Witness Church confirmed that hunch for us."
}