{
    "title": "White-boards and addressing problems visually (Church Branding #2)",
    "date": "2019-07-27",
    "tags": [
        "brand strategy",
        "identity design"
    ],
    "body": "In this article, we'll talk about how to build client trust, establish a strategic roadmap, and rely on visuals during strategy sessions. The church we're rebranding in this series is called 'Witness Church.' Witness Church is a multi-site, nondenominational church with locations in major Italian cities. Right now, they're struggling to distinguish themselves from the many other well-known churches and cathedrals in Italy.<br />Let’s try to help them develop a brand identity that will set them apart and help them acheive their goals for the next several decades.<br /><h2>Giving our impression of the client's challenges.</h2>One of the most powerful ways we can form a bond with someone is when they speak our thoughts out loud. It gives us perspective, puts us in a position to be objective, and makes us feel heard and understood.<br />That’s what we want to give to our branding client, Witness Church. Regardless of whether they are a nonprofit, small business, or large corporation, this step is critical in setting up a shared vision and understanding one another during the process of creating a good brand identity.<br />Let’s articulate back to the client what we understand to be the challenges they’re facing. We’ll use as much illustration as possible because seeing an idea visually gets everyone on the same page. It also can reveal logical disconnects or hard-to-explain ideas (white boards are great for this, but paper or digital works too).<br />In this case, it might have turned out that we missed something during our session with the client. On top of wanting to send a clearer message of their identity to attract nonbelievers and evangelical Christians, Witness Church wants to specifically target people over the age of 35. They feel that it’s unhealthy for a Church their size to be almost entirely young adults.<br />This is important, because it means our final solution can’t exclude one generation or another. That would create a conflict between Witness Church’s younger membership now and the more diverse age ranges in their desired future state."
}