{
    "title": "Ditch the white board - Better tools for collaborating in a rebrand",
    "date": "2019-08-04",
    "tags": [
        "business",
        "branding",
        "brand strategy"
    ],
    "body": "In this article, we'll talk about how to build a strategic roadmap during strategy sessions. The church we're rebranding in this series is called 'Witness Church.' Witness Church is a multi-site, nondenominational church with locations in major Italian cities. Right now, they're struggling to distinguish themselves from the many other well-known churches and cathedrals in Italy.<br />Let’s try to help them develop a brand identity that will set them apart and help them acheive their goals for the next several decades.<br />One of the most powerful ways we can form a bond with someone is when they speak our thoughts out loud. It gives us perspective, puts us in a position to be objective, and makes us feel heard and understood.<br />A good branding consultant or designer understands this, that’s what they would want to give Witness Church. As business owners, we need a chance to objectively address the problems facing our company. Whether a nonprofit, small business, or large corporation, this step is critical in setting up a shared vision for everyone during the process of refreshing or creating a brand identity.<br />The consultant or designer would articulate back to us what they understand to be the challenges we're facing. We’ll use as much illustration as possible because seeing an idea visually gets everyone on the same page. It also can reveal logical disconnects or hard-to-explain ideas White boards can work for this, but an online tool like <a href='https://www.taskade.com' target='_blank'>Taskade</a> is even better.<br />Business owners, it is so important that we have a way to append the notes from a strategy session. In this case, Witness Church could have forgotten to add that they want to specifically target people over the age of 35. They feel that it’s unhealthy for a Church their size to be almost entirely young adults.<br />This is important, because it means our final solution can’t exclude one generation or another. That would create a conflict between the organization's younger membership and the more diverse age ranges in their desired future state."
}